# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license


# Parameters
nc: 2 # number of classes
scales:
  s: [0.50, 0.50, 1024]

backbone:

  - [-1, 1, Conv, [64, 3, 2]]           # 0
  - [-1, 1, Conv, [128, 3, 2]]          # 1
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, GSPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10 

head:
  - [-1, 1, LDAEM, [1024]]                      # 11 
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 6], 1, Concat, [1]]                  # 13
  - [-1, 2, C2f_DCD, [512, False]]                # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]]                  # 16
  - [-1, 2, C2f_DCD, [256, False]]                # 17 

  - [-1, 1, LDAEM, [256]]                      # 18 
  - [-1, 1, Conv, [256, 3, 2]]                 # 19
  - [[-1, 14], 1, Concat, [1]]                 # 20 
  - [-1, 2, C2f_DCD, [512, False]]                # 21

  - [-1, 1, Conv, [512, 3, 2]]                 # 22
  - [[-1, 10], 1, Concat, [1]]                 # 23
  - [-1, 2, C2f_DCD, [1024, True]]                # 24

  # -------- Detect --------
  - [[17, 21, 24], 1, Detect, [nc]]            # 25
